poisellePlacasPlanas/Re-20-of-10/m-25k/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    entrada
    {
        type            zeroGradient;
    }
    saida
    {
        type            fixedValue;
        value		uniform 0;
    }
    parede
    {
        type            zeroGradient;
    }
    centro
    {
    	type	symmetryPlane;
    }
    zPlan
    {
        type            empty;
    }
}

// ************************************************************************* //
